01.laminar_channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (6 0 0)
    (6 2 0)
    (0 2 0)
    (0 0 0.1)
    (6 0 0.1)
    (6 2 0.1)
    (0 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
        );
    }
    inletSurf
    {
        type cyclic;
	neighbourPatch outletSurf;
        faces
        (
            (0 3 7 4)
        );
    }
    outletSurf
    {
        type cyclic;
	neighbourPatch inletSurf;
        faces
        (
            (1 5 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);


// ************************************************************************* //
